sccn/secureLSL/liblsl-ESP32/examples/secure_outlet/sdkconfig.defaults
# ESP32 target
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Stack size for main task (security needs more stack for key derivation)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# WiFi
CONFIG_ESP_WIFI_SSID="your_ssid"
CONFIG_ESP_WIFI_PASSWORD="your_password"

# IGMP for multicast support (required for LSL discovery)
CONFIG_LWIP_IGMP=y

# 1000Hz tick rate for precise sample timing (250Hz needs 4ms resolution)
CONFIG_FREERTOS_HZ=1000
